onviflibs/gsoap/gsoap-2.8/gsoap/samples/autotest/databinding/examples/6/09/HexBinaryElement/echoHexBinaryElement-HexBinaryElement02-soap12.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
                    
                    Copyright (C) 2006 W3C (R) (MIT ERCIM Keio), All Rights Reserved.
                    W3C liability, trademark and document use rules apply.
                    
                    http://www.w3.org/Consortium/Legal/ipr-notice
                    http://www.w3.org/Consortium/Legal/copyright-documents
                    
		    Generated from: $Id: examples.xml,v 1.57 2008/02/20 16:41:48 pdowney Exp $
-->
<env:Envelope xmlns:xs="http://www.w3.org/2001/XMLSchema"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
              xmlns:p="http://www.w3.org/2002/ws/databinding/patterns/6/09/"
              xmlns:ex="http://www.w3.org/2002/ws/databinding/examples/6/09/"
              xmlns:env="http://www.w3.org/2003/05/soap-envelope">
   <env:Header/>
   <env:Body>
      <ex:echoHexBinaryElement>
         <ex:hexBinaryElement xmlns:wsdl11="http://schemas.xmlsoap.org/wsdl/"
                              xmlns:soap11enc="http://schemas.xmlsoap.org/soap/encoding/">77696f646d6f6e7974637174716a7169696e6b65616f76786f746e66716b707875757261736e686469796b65706c656d7465626661637661646e6b65636662647669726d6f6e757361</ex:hexBinaryElement>
      </ex:echoHexBinaryElement>
   </env:Body>
</env:Envelope>